Revit 2017 API
IndependentTag.TaggedElementId Property
 The LinkElementId of the tagged element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public LinkElementId TaggedElementId { get; }
Visual Basic
Public ReadOnly Property TaggedElementId As LinkElementId
	Get
Visual C++
public:
property LinkElementId^ TaggedElementId {
	LinkElementId^ get ();
}
Remarks
 If there is no tagged element because the tag is orphaned, LinkElementId.HostElementId, LinkElementId.LinkElementId and LinkElementId.LinkInstanceId will be InvalidElementId.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace